# Напишите программу, которая создает функцию для списка всех четных чисел от 4 до
# 30.
# Output: [4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28]
import math
def chetnie():
    return list(range(4, 31, 2))
a = chetnie()
print(a)



