# Задание №1.
# Используя цикл while, выведите на экран для числа 2 его степени от 0 до 20. Возведение
# в степень в Python обозначается как **.
a = 2
b = 0
while b < 20:
    b += 1
    print(b, a**b)
