# Задание №1.
# Написать программу для вывода узора по образцу, используя вложенный цикл.
for a in range(1, 10):
    if a <= 5:
        print("* " * a)
    else:
        print("* " * (10 - a))




