# Задание №1.
# Напишите программу, в которой я ввожу два целостных числа, и если первое число больше второго,
# то программа выведет true, иначе false.

a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
if  a > b:
    print("True")
else:
    print("False")