# Задание №4.
# Напишите программу, в которой я ввожу два целостных числа, и если первое число больше
# второго, то программа выведет true, иначе false.
a = int(input("Введите число а: "))
b = int(input("Введите число b: "))
if a > b:
    print(True)
else:
    print(False)