# Задание №4.
# Напишите программу, где ввожу число n, и если оно является положительным, то
# прибавьте к нему 1; в противном случае не изменять его. Выведите полученное число.
n = float(input("Введте число n: "))
if n >= 0:
   print(n + 1)
else:
   print(n)
