# Напишите функцию, которая принимает один аргумент для лямбды функции и этот
# аргумент будет умножен на неизвестное заданное число.

n = int(input("Введите число n: "))
print((lambda x: x * 15)(n))